---
kind: property
id: P:Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Prefix
source: html/65d947f6-178e-eb15-c249-0c82ae3357bc.htm
---
# Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Prefix Property

The prefix to include before the parameter value.

## Syntax (C#)
```csharp
public string Prefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null